       01 LOANINFO.
           03 PRINCIPAL              PIC S9(8) COMP-3.
           03 LOANTERM               PIC S9(8) COMP-3.
           03 RATE                   PIC S9(9)V9(9).
